---
kind: type
id: T:Autodesk.Revit.DB.PointCloudType
source: html/b7ba9b9c-fd96-7506-1585-6fc2b327e0e9.htm
---
# Autodesk.Revit.DB.PointCloudType

Represents a type of point cloud loaded into a Revit document. Each PointCloudType maps to
 a single file or identifier (depending upon the type of Point Cloud Engine which governs it).

## Syntax (C#)
```csharp
public class PointCloudType : ElementType
```